In [1]:
import os
import mysql.connector as connector
import logging

In [3]:
logger = logging.getLogger("[Views MySQL]")
if os.path.exists("../log/views-mysql.log"):
  os.remove("../log/views-mysql.log")
logging.basicConfig(filename='../log/views-mysql.log', encoding='utf-8', level=logging.DEBUG, format='%(asctime)s ==> %(message)s', datefmt='%m/%d/%Y %I:%M:%S')

In [50]:
logger.info("Creating a connection between MySQL and Python")
dbconfig={"user":"root", "password":os.environ["MYSQL_PASSWORD"], "port":33061, "host":"localhost"}
connection=connector.connect(**dbconfig)
print("Connection established between MySQL and Python")
logger.info("Connection established between MySQL and Python")

Connection established between MySQL and Python

In [51]:
print("Creating cursor object from connection")
logger.info("Creating first cursor object from connection")
cursor = connection.cursor()
print("Cursor object created to communicate with MySQL using Python.")
logger.info("Cursor object created to communicate with MySQL using Python.")

Creating cursor object from connection
Cursor object created to communicate with MySQL using Python.

In [52]:
# Get a cursor object from the cursor pool
database_name: str = "db_views"
drop_database_query: str = f"""DROP DATABASE IF EXISTS {database_name}"""
cursor.execute(drop_database_query)
logger.info("Dropping Database if it already exists.")

create_database_query: str = f"""CREATE DATABASE IF NOT EXISTS {database_name}"""
print("Creating Database.")
logger.info("Creating Database.")
cursor.execute(create_database_query)
logger.info("Database created.")
print("Database created.")

Creating Database.
Database created.

In [53]:
# Check to see that the database was created
list_of_databases: list = []
cursor.execute("SHOW DATABASES;")
databases = cursor.fetchall()
for database in databases:
    db_name: str = database[0]
    list_of_databases.append(db_name)
    if db_name == database_name:
        print(f"Database '{database_name}' was successfully created")
        logger.info(f"Database '{database_name}' was successfully created.")
        break

# Set the new created database as the database to use
cursor.execute(f"USE {database_name}")
print(f"Database '{database_name}' set for use.")
logger.info(f"Database '{database_name}' set for use.")

Database 'db_subqueries' was successfully created
Database 'db_subqueries' set for use.

In [54]:
create_orders_query = """CREATE TABLE IF NOT EXISTS tbl_orders (OrderID INT NOT NULL PRIMARY KEY, ProductID INT, CustomerID INT, SalesPersonID INT, OrderDate Date, ShipDate DATE, OrderStatus VARCHAR(50), ShipAddress VARCHAR(255), BillAddress VARCHAR(255), 
Quantity INT, Sales INT, CreationTime TimeStamp);"""
cursor.execute(create_orders_query)
logger.info("tbl_orders table created.")

create_products_query = """CREATE TABLE IF NOT EXISTS tbl_products (ProductID INT NOT NULL PRIMARY KEY, Product VARCHAR(50), Category VARCHAR(50), Price INT);"""
cursor.execute(create_products_query)
logger.info("tbl_products table created.")

create_customers_query = """CREATE TABLE IF NOT EXISTS tbl_customers (CustomerID INT NOT NULL PRIMARY KEY, FirstName VARCHAR(50), LastName VARCHAR(50), Country VARCHAR(50), Score INT);"""
cursor.execute(create_customers_query)
logger.info("tbl_customers table created.")

create_employees_query = """CREATE TABLE IF NOT EXISTS tbl_employees (EmployeeID INT NOT NULL PRIMARY KEY, FirstName VARCHAR(50), LastName VARCHAR(50), Department VARCHAR(50), BirthDate Date, Gender CHAR(1), Salary INT, ManagerID INT);"""
cursor.execute(create_employees_query)
logger.info("tbl_employees table created.")

In [55]:
insert_into_orders_query = """INSERT INTO tbl_orders(OrderID, ProductID, CustomerID, SalesPersonID, OrderDate, ShipDate, OrderStatus, ShipAddress, BillAddress, Quantity, Sales, CreationTime) VALUES
(1, 101, 2, 3, '2025-01-01', '2025-01-05', 'Delivered', '9833 Mt. Dias Blv.', '1226 Shoe St.', 1, 10, '2025-01-01 12:34:56.0000000'),  
(2, 102, 3,	3, '2025-01-05', '2025-01-10', 'Shipped', '250 Race Court', NULL, 1, 15, '2025-01-05 23:22:04.0000000'),
(3, 101, 1,	5, '2025-01-10', '2025-01-25', 'Delivered', '8157 W. Book', '8157 W. Book', 2, 20, '2025-01-10 18:24:08.0000000'),
(4, 105, 1, 3, '2025-01-20', '2025-01-25', 'Shipped', '5724 Victory Lane', '',	2, 60, '2025-01-20 05:50:33.0000000'),
(5, 104, 2, 5, '2025-02-01', '2025-02-05', 'Delivered', NULL , NULL , 1, 25, '2025-02-01 14:02:41.0000000'),
(6, 104, 3, 5, '2025-02-05', '2025-02-10', 'Delivered', '1792 Belmont Rd.',NULL , 2, 50, '2025-02-06 15:34:57.0000000'),
(7, 102, 1, 1, '2025-02-15', '2025-02-27', 'Delivered', '136 Balboa Court', '' , 2, 30, '2025-02-16 06:22:01.0000000'),
(8, 101, 4, 3, '2025-02-18', '2025-02-27', 'Shipped', '2947 Vine Lane', '4311 Clay Rd', 3, 90, '2025-02-18 10:45:22.0000000'),
(9, 101, 2, 3, '2025-03-10', '2025-03-15', 'Shipped', '3768 Door Way', '', 2, 20, '2025-03-10 12:59:04.0000000'),
(10, 102, 3, 5, '2025-03-15', '2025-03-20', 'Shipped', NULL , NULL, 0, 60, '2025-03-16 23:25:15.0000000');"""

cursor.execute(insert_into_orders_query)
connection.commit()

insert_into_products_query = """INSERT INTO tbl_products(ProductID, Product, Category, Price) VALUES
(101, 'Bottle', 'Accessories', 10),  
(102, 'Tire', 'Accessories', 15),
(103, 'Socks', 'Clothing', 20),  
(104, 'Caps', 'Clothing', 25),
(105, 'Gloves', 'Clothing', 30);"""

value = None

cursor.execute(insert_into_products_query)
connection.commit()


insert_into_customers_query = """INSERT INTO tbl_customers(CustomerID, FirstName, LastName, Country, Score) VALUES
(1, 'Jossef', 'Goldberg', 'Germany', 350),
(2, 'Kevin', 'Brown', 'USA', 900),
(3, 'Mary', NULL, 'USA', 750),
(4, 'Mark', 'Schwarz', 'Germany', 500),
(5, 'Anna', 'Adams', 'USA', NULL);"""

cursor.execute(insert_into_customers_query)
connection.commit()

insert_into_employees_query = """INSERT INTO tbl_employees(EmployeeID, FirstName, LastName, Department, BirthDate, Gender, Salary, ManagerID) VALUES
(1, 'Frank', 'Lee', 'Marketing', '1988-12-05', 'M', 55000, NULL),
(2, 'Kevin', 'Brown', 'Marketing', '1972-11-25', 'M', 65000, 1),
(3, 'Mary', NULL, 'Sales', '1986-01-05', 'F', 75000, 1), 
(4, 'Michael', 'Ray', 'Sales', '1977-02-10', 'M', 90000, 2), 
(5, 'Carol', 'Baker', 'Sales', '1982-02-11', 'F', 55000, 3);"""

cursor.execute(insert_into_employees_query)
connection.commit()

## Function to Display results

In [56]:
def select_all_query(table_name: str):
    query = f"""SELECT * FROM {table_name};"""
    return query


def display_results(table_column_names: list, results: list):
    table_columns_length = [len(x) for x in table_column_names]
    for result in results:
        for value in range(len(result)):
            row_data = result[value]
            if row_data:
                row_data = str(row_data)
                if len(row_data) > table_columns_length[value]:
                    table_columns_length[value] = len(row_data)
    dashes_plus = ""
    for num in range(len(table_columns_length)):
        dashes_plus = dashes_plus + "+" + '-'*(table_columns_length[num]+2)
    dashes_plus = dashes_plus + "+"
    
    print(dashes_plus)
    
    table_headers = ""
    for num in range(len(table_column_names)):
        table_headers = table_headers + f"| {table_column_names[num]:^{table_columns_length[num]}} "
    table_headers = table_headers + "|"
    print(table_headers)
    
    print(dashes_plus)
    
    for result in results:
        table_row = ""
        for value in range(len(result)):
            row_data = result[value]
            if row_data is None:
                row_data = "NULL"            
                #if "Field" in table_column_names or "select_type" in table_column_names:
                    #row_data = None
                #else:
                    #row_data = None
            table_row = table_row + "|" + f"{str(row_data):^{table_columns_length[value]+2}}"
        print(table_row + "|")
    print(dashes_plus)
    print(f"{len(results)} rows returned")

def execute_display_query_results(query: str = "", table_column_names: list = [], results: list = []): 
    if query:
        logger.info(f"Executing the query: {query}")
    if len(query) > 2 and (table_column_names or results):
        print("You can only pass in the query alone or the table_column_names and results list")
        assert False
    if query and not table_column_names and not results:
        cursor.execute(query)
        results = cursor.fetchall()    
        table_column_names = cursor.column_names
    
    display_results(table_column_names, results)

In [57]:
execute_display_query_results(select_all_query("tbl_orders"))
print("\n")
execute_display_query_results(select_all_query("tbl_products"))
print("\n")
execute_display_query_results(select_all_query("tbl_customers"))

+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
| OrderID | ProductID | CustomerID | SalesPersonID | OrderDate  |  ShipDate  | OrderStatus |    ShipAddress     |  BillAddress  | Quantity | Sales |    CreationTime     |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
|    1    |    101    |     2      |       3       | 2025-01-01 | 2025-01-05 |  Delivered  | 9833 Mt. Dias Blv. | 1226 Shoe St. |    1     |  10   | 2025-01-01 12:34:56 |
|    2    |    102    |     3      |       3       | 2025-01-05 | 2025-01-10 |   Shipped   |   250 Race Court   |     NULL      |    1     |  15   | 2025-01-05 23:22:04 |
|    3    |    101    |     1      |       5       | 2025-01-10 | 2025-01-25 |  Delivered  |    8157 W. Book    | 8157 W. Book  |    2     |  20   | 2025-01-10 18:24:08 |
|    4    |    105    |     1      |       3       | 2025-01-20 | 2025-01-25 |   Shipped   | 5724 Victory Lane  |               |    2     |  60   | 2025-01-20 05:50:33 |
|    5    |    104    |     2      |       5       | 2025-02-01 | 2025-02-05 |  Delivered  |        NULL        |     NULL      |    1     |  25   | 2025-02-01 14:02:41 |
|    6    |    104    |     3      |       5       | 2025-02-05 | 2025-02-10 |  Delivered  |  1792 Belmont Rd.  |     NULL      |    2     |  50   | 2025-02-06 15:34:57 |
|    7    |    102    |     1      |       1       | 2025-02-15 | 2025-02-27 |  Delivered  |  136 Balboa Court  |               |    2     |  30   | 2025-02-16 06:22:01 |
|    8    |    101    |     4      |       3       | 2025-02-18 | 2025-02-27 |   Shipped   |   2947 Vine Lane   | 4311 Clay Rd  |    3     |  90   | 2025-02-18 10:45:22 |
|    9    |    101    |     2      |       3       | 2025-03-10 | 2025-03-15 |   Shipped   |   3768 Door Way    |               |    2     |  20   | 2025-03-10 12:59:04 |
|   10    |    102    |     3      |       5       | 2025-03-15 | 2025-03-20 |   Shipped   |        NULL        |     NULL      |    0     |  60   | 2025-03-16 23:25:15 |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
10 rows returned


+-----------+---------+-------------+-------+
| ProductID | Product |  Category   | Price |
+-----------+---------+-------------+-------+
|    101    | Bottle  | Accessories |  10   |
|    102    |  Tire   | Accessories |  15   |
|    103    |  Socks  |  Clothing   |  20   |
|    104    |  Caps   |  Clothing   |  25   |
|    105    | Gloves  |  Clothing   |  30   |
+-----------+---------+-------------+-------+
5 rows returned


+------------+-----------+----------+---------+-------+
| CustomerID | FirstName | LastName | Country | Score |
+------------+-----------+----------+---------+-------+
|     1      |  Jossef   | Goldberg | Germany |  350  |
|     2      |   Kevin   |  Brown   |   USA   |  900  |
|     3      |   Mary    |   NULL   |   USA   |  750  |
|     4      |   Mark    | Schwarz  | Germany |  500  |
|     5      |   Anna    |  Adams   |   USA   | NULL  |
+------------+-----------+----------+---------+-------+
5 rows returned

# Database Server
This stores, manages, and provides access to databases for users or applications

## Table
This a place where data is stored and organized into rows and columns

## Views 
This is a virtual table that shows data without storing it physically. It is based on the result set of a query. Views are persisted SQL queries in the database
They are used to store central, complex query logic in the database for access by multiple queries, reducing project complexity

## DDL - Data Definition Language
A set of commands that allows us to define and manage the structure of a database. **CREATE**, **ALTER**, **DROP**

## Physical Level
Lowest level. This stores Data Files, Partitions, Logs, Catalog, Blocks, Caches

# Subqueries

## Task 1
Find the products that have a price higher than the average proce of all products

In [58]:
select_query = """SELECT * FROM (SELECT ProductID, Price, AVG(Price) OVER() AS AvgPrice FROM tbl_products) AS t WHERE Price > AvgPrice;"""
execute_display_query_results(select_query)

+-----------+-------+----------+
| ProductID | Price | AvgPrice |
+-----------+-------+----------+
|    104    |  25   | 20.0000  |
|    105    |  30   | 20.0000  |
+-----------+-------+----------+
2 rows returned

## Task 2
-- Rank the customers based on their total amount of sales

In [59]:
select_query = """SELECT *,
RANK() OVER(ORDER BY TotalSales DESC) AS CustomerRank
FROM (SELECT CustomerID, SUM(Sales) AS TotalSales FROM tbl_orders GROUP BY CustomerID) AS TotalSalesTable;"""

execute_display_query_results(select_query)

+------------+------------+--------------+
| CustomerID | TotalSales | CustomerRank |
+------------+------------+--------------+
|     3      |    125     |      1       |
|     1      |    110     |      2       |
|     4      |     90     |      3       |
|     2      |     55     |      4       |
+------------+------------+--------------+
4 rows returned

## Select Subquery
Used to aggregate data side by side with the main query's data, allowing for direct comparison
```sql
-- In this case, only Scalar subqueries are allowed to be used
SELECT Column1, (SELECT column FROM table1 where condition) AS alias
FROM table1
```

## Task 3
Show the product IDs, names, prices, and total number of orders

In [60]:
select_query = """SELECT ProductID, Product, price, (SELECT COUNT(*) FROM tbl_orders) AS TotalNumberOfOrders FROM tbl_products;"""
execute_display_query_results(select_query)

+-----------+---------+-------+---------------------+
| ProductID | Product | price | TotalNumberOfOrders |
+-----------+---------+-------+---------------------+
|    101    | Bottle  |  10   |         10          |
|    102    |  Tire   |  15   |         10          |
|    103    |  Socks  |  20   |         10          |
|    104    |  Caps   |  25   |         10          |
|    105    | Gloves  |  30   |         10          |
+-----------+---------+-------+---------------------+
5 rows returned

In [61]:
select_query = """SELECT Product, price, (SELECT COUNT(*) FROM tbl_orders WHERE ProductID = 101) AS TotalNumberOfOrders FROM tbl_products WHERE ProductID = 101;"""
execute_display_query_results(select_query)

+---------+-------+---------------------+
| Product | price | TotalNumberOfOrders |
+---------+-------+---------------------+
| Bottle  |  10   |          4          |
+---------+-------+---------------------+
1 rows returned

In [62]:
select_query = """SELECT Product, price, (SELECT COUNT(*) FROM tbl_orders WHERE ProductID = 102) AS TotalNumberOfOrders FROM tbl_products WHERE ProductID = 102;"""
execute_display_query_results(select_query)

+---------+-------+---------------------+
| Product | price | TotalNumberOfOrders |
+---------+-------+---------------------+
|  Tire   |  15   |          3          |
+---------+-------+---------------------+
1 rows returned

In [63]:
select_query = """SELECT Product, price, (SELECT COUNT(*) FROM tbl_orders WHERE ProductID = 103) AS TotalNumberOfOrders FROM tbl_products WHERE ProductID = 103;"""
execute_display_query_results(select_query)

+---------+-------+---------------------+
| Product | price | TotalNumberOfOrders |
+---------+-------+---------------------+
|  Socks  |  20   |          0          |
+---------+-------+---------------------+
1 rows returned

In [64]:
select_query = """SELECT Product, price, (SELECT COUNT(*) FROM tbl_orders WHERE ProductID = 104) AS TotalNumberOfOrders FROM tbl_products WHERE ProductID = 104;"""
execute_display_query_results(select_query)

+---------+-------+---------------------+
| Product | price | TotalNumberOfOrders |
+---------+-------+---------------------+
|  Caps   |  25   |          2          |
+---------+-------+---------------------+
1 rows returned

In [65]:
select_query = """SELECT Product, price, (SELECT COUNT(*) FROM tbl_orders WHERE ProductID = 105) AS TotalNumberOfOrders FROM tbl_products WHERE ProductID = 105;"""
execute_display_query_results(select_query)

+---------+-------+---------------------+
| Product | price | TotalNumberOfOrders |
+---------+-------+---------------------+
| Gloves  |  30   |          1          |
+---------+-------+---------------------+
1 rows returned

## Task 4: Subquery in JOIN Clause
Show all customer details and find the total orders for each customer

In [66]:
execute_display_query_results(select_all_query("tbl_orders"))
print("\n")
execute_display_query_results(select_query)

+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
| OrderID | ProductID | CustomerID | SalesPersonID | OrderDate  |  ShipDate  | OrderStatus |    ShipAddress     |  BillAddress  | Quantity | Sales |    CreationTime     |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
|    1    |    101    |     2      |       3       | 2025-01-01 | 2025-01-05 |  Delivered  | 9833 Mt. Dias Blv. | 1226 Shoe St. |    1     |  10   | 2025-01-01 12:34:56 |
|    2    |    102    |     3      |       3       | 2025-01-05 | 2025-01-10 |   Shipped   |   250 Race Court   |     NULL      |    1     |  15   | 2025-01-05 23:22:04 |
|    3    |    101    |     1      |       5       | 2025-01-10 | 2025-01-25 |  Delivered  |    8157 W. Book    | 8157 W. Book  |    2     |  20   | 2025-01-10 18:24:08 |
|    4    |    105    |     1      |       3       | 2025-01-20 | 2025-01-25 |   Shipped   | 5724 Victory Lane  |               |    2     |  60   | 2025-01-20 05:50:33 |
|    5    |    104    |     2      |       5       | 2025-02-01 | 2025-02-05 |  Delivered  |        NULL        |     NULL      |    1     |  25   | 2025-02-01 14:02:41 |
|    6    |    104    |     3      |       5       | 2025-02-05 | 2025-02-10 |  Delivered  |  1792 Belmont Rd.  |     NULL      |    2     |  50   | 2025-02-06 15:34:57 |
|    7    |    102    |     1      |       1       | 2025-02-15 | 2025-02-27 |  Delivered  |  136 Balboa Court  |               |    2     |  30   | 2025-02-16 06:22:01 |
|    8    |    101    |     4      |       3       | 2025-02-18 | 2025-02-27 |   Shipped   |   2947 Vine Lane   | 4311 Clay Rd  |    3     |  90   | 2025-02-18 10:45:22 |
|    9    |    101    |     2      |       3       | 2025-03-10 | 2025-03-15 |   Shipped   |   3768 Door Way    |               |    2     |  20   | 2025-03-10 12:59:04 |
|   10    |    102    |     3      |       5       | 2025-03-15 | 2025-03-20 |   Shipped   |        NULL        |     NULL      |    0     |  60   | 2025-03-16 23:25:15 |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
10 rows returned


+---------+-------+---------------------+
| Product | price | TotalNumberOfOrders |
+---------+-------+---------------------+
| Gloves  |  30   |          1          |
+---------+-------+---------------------+
1 rows returned

In [67]:
select_query = "SELECT CustomerID, COUNT(*) FROM tbl_orders GROUP BY CustomerID;"
execute_display_query_results(select_query)

+------------+----------+
| CustomerID | COUNT(*) |
+------------+----------+
|     2      |    3     |
|     3      |    3     |
|     1      |    3     |
|     4      |    1     |
+------------+----------+
4 rows returned

In [68]:
select_query = """SELECT tbl_customers.*, Orders.TotalOrders FROM tbl_customers
LEFT JOIN (SELECT CustomerID, COUNT(*) AS TotalOrders FROM tbl_orders GROUP BY CustomerID) AS Orders
ON tbl_customers.CustomerID = Orders.CustomerID;"""
execute_display_query_results(select_query)

+------------+-----------+----------+---------+-------+-------------+
| CustomerID | FirstName | LastName | Country | Score | TotalOrders |
+------------+-----------+----------+---------+-------+-------------+
|     1      |  Jossef   | Goldberg | Germany |  350  |      3      |
|     2      |   Kevin   |  Brown   |   USA   |  900  |      3      |
|     3      |   Mary    |   NULL   |   USA   |  750  |      3      |
|     4      |   Mark    | Schwarz  | Germany |  500  |      1      |
|     5      |   Anna    |  Adams   |   USA   | NULL  |    NULL     |
+------------+-----------+----------+---------+-------+-------------+
5 rows returned

## Task 5: Subquery in WHERE Clause
Find the products that have a price higher than the average proce of all products

In [69]:
select_query = """SELECT *, (SELECT AVG(Price) FROM tbl_products) AS AvgPrice FROM tbl_products WHERE Price > (SELECT AVG(Price) AS AvgPrice FROM tbl_products);"""
execute_display_query_results(select_query)

+-----------+---------+----------+-------+----------+
| ProductID | Product | Category | Price | AvgPrice |
+-----------+---------+----------+-------+----------+
|    104    |  Caps   | Clothing |  25   | 20.0000  |
|    105    | Gloves  | Clothing |  30   | 20.0000  |
+-----------+---------+----------+-------+----------+
2 rows returned

## Task 6: Subquery in IN Operator
Show the details of orders made by customers in Germany

In [70]:
select_query = "SELECT * FROM tbl_customers WHERE Country = 'Germany';"
execute_display_query_results(select_query)

+------------+-----------+----------+---------+-------+
| CustomerID | FirstName | LastName | Country | Score |
+------------+-----------+----------+---------+-------+
|     1      |  Jossef   | Goldberg | Germany |  350  |
|     4      |   Mark    | Schwarz  | Germany |  500  |
+------------+-----------+----------+---------+-------+
2 rows returned

In [71]:
select_query = """SELECT * FROM tbl_orders 
WHERE CustomerID IN 
(SELECT CustomerID FROM tbl_customers WHERE Country = 'Germany');"""
execute_display_query_results(select_query)

+---------+-----------+------------+---------------+------------+------------+-------------+-------------------+--------------+----------+-------+---------------------+
| OrderID | ProductID | CustomerID | SalesPersonID | OrderDate  |  ShipDate  | OrderStatus |    ShipAddress    | BillAddress  | Quantity | Sales |    CreationTime     |
+---------+-----------+------------+---------------+------------+------------+-------------+-------------------+--------------+----------+-------+---------------------+
|    3    |    101    |     1      |       5       | 2025-01-10 | 2025-01-25 |  Delivered  |   8157 W. Book    | 8157 W. Book |    2     |  20   | 2025-01-10 18:24:08 |
|    4    |    105    |     1      |       3       | 2025-01-20 | 2025-01-25 |   Shipped   | 5724 Victory Lane |              |    2     |  60   | 2025-01-20 05:50:33 |
|    7    |    102    |     1      |       1       | 2025-02-15 | 2025-02-27 |  Delivered  | 136 Balboa Court  |              |    2     |  30   | 2025-02-16 06:22:01 |
|    8    |    101    |     4      |       3       | 2025-02-18 | 2025-02-27 |   Shipped   |  2947 Vine Lane   | 4311 Clay Rd |    3     |  90   | 2025-02-18 10:45:22 |
+---------+-----------+------------+---------------+------------+------------+-------------+-------------------+--------------+----------+-------+---------------------+
4 rows returned

In [72]:
# Show the details of orders made by customers in Germany
select_query = """SELECT * FROM tbl_orders 
WHERE CustomerID IN 
(SELECT CustomerID FROM tbl_customers WHERE Country <> 'Germany');"""
execute_display_query_results(select_query)

+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
| OrderID | ProductID | CustomerID | SalesPersonID | OrderDate  |  ShipDate  | OrderStatus |    ShipAddress     |  BillAddress  | Quantity | Sales |    CreationTime     |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
|    1    |    101    |     2      |       3       | 2025-01-01 | 2025-01-05 |  Delivered  | 9833 Mt. Dias Blv. | 1226 Shoe St. |    1     |  10   | 2025-01-01 12:34:56 |
|    2    |    102    |     3      |       3       | 2025-01-05 | 2025-01-10 |   Shipped   |   250 Race Court   |     NULL      |    1     |  15   | 2025-01-05 23:22:04 |
|    5    |    104    |     2      |       5       | 2025-02-01 | 2025-02-05 |  Delivered  |        NULL        |     NULL      |    1     |  25   | 2025-02-01 14:02:41 |
|    6    |    104    |     3      |       5       | 2025-02-05 | 2025-02-10 |  Delivered  |  1792 Belmont Rd.  |     NULL      |    2     |  50   | 2025-02-06 15:34:57 |
|    9    |    101    |     2      |       3       | 2025-03-10 | 2025-03-15 |   Shipped   |   3768 Door Way    |               |    2     |  20   | 2025-03-10 12:59:04 |
|   10    |    102    |     3      |       5       | 2025-03-15 | 2025-03-20 |   Shipped   |        NULL        |     NULL      |    0     |  60   | 2025-03-16 23:25:15 |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
6 rows returned

In [73]:
# Show the details of orders made by customers in Germany
select_query = """SELECT * FROM tbl_orders 
WHERE CustomerID NOT IN 
(SELECT CustomerID FROM tbl_customers WHERE Country = 'Germany');"""
execute_display_query_results(select_query)

+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
| OrderID | ProductID | CustomerID | SalesPersonID | OrderDate  |  ShipDate  | OrderStatus |    ShipAddress     |  BillAddress  | Quantity | Sales |    CreationTime     |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
|    1    |    101    |     2      |       3       | 2025-01-01 | 2025-01-05 |  Delivered  | 9833 Mt. Dias Blv. | 1226 Shoe St. |    1     |  10   | 2025-01-01 12:34:56 |
|    2    |    102    |     3      |       3       | 2025-01-05 | 2025-01-10 |   Shipped   |   250 Race Court   |     NULL      |    1     |  15   | 2025-01-05 23:22:04 |
|    5    |    104    |     2      |       5       | 2025-02-01 | 2025-02-05 |  Delivered  |        NULL        |     NULL      |    1     |  25   | 2025-02-01 14:02:41 |
|    6    |    104    |     3      |       5       | 2025-02-05 | 2025-02-10 |  Delivered  |  1792 Belmont Rd.  |     NULL      |    2     |  50   | 2025-02-06 15:34:57 |
|    9    |    101    |     2      |       3       | 2025-03-10 | 2025-03-15 |   Shipped   |   3768 Door Way    |               |    2     |  20   | 2025-03-10 12:59:04 |
|   10    |    102    |     3      |       5       | 2025-03-15 | 2025-03-20 |   Shipped   |        NULL        |     NULL      |    0     |  60   | 2025-03-16 23:25:15 |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
6 rows returned

## Task 7: Subquery in WHERE Clause ANY Operator
Find female employees whose salaries are greater than the salaries of any male employees

In [74]:
select_query = """SELECT * FROM tbl_employees;"""
execute_display_query_results(select_query)

+------------+-----------+----------+------------+------------+--------+--------+-----------+
| EmployeeID | FirstName | LastName | Department | BirthDate  | Gender | Salary | ManagerID |
+------------+-----------+----------+------------+------------+--------+--------+-----------+
|     1      |   Frank   |   Lee    | Marketing  | 1988-12-05 |   M    | 55000  |   NULL    |
|     2      |   Kevin   |  Brown   | Marketing  | 1972-11-25 |   M    | 65000  |     1     |
|     3      |   Mary    |   NULL   |   Sales    | 1986-01-05 |   F    | 75000  |     1     |
|     4      |  Michael  |   Ray    |   Sales    | 1977-02-10 |   M    | 90000  |     2     |
|     5      |   Carol   |  Baker   |   Sales    | 1982-02-11 |   F    | 55000  |     3     |
+------------+-----------+----------+------------+------------+--------+--------+-----------+
5 rows returned

In [75]:
select_query = """SELECT * FROM tbl_employees 
WHERE Gender = 'F' AND Salary > ANY(SELECT SALARY FROM tbl_employees WHERE Gender = 'M');"""
execute_display_query_results(select_query)

+------------+-----------+----------+------------+------------+--------+--------+-----------+
| EmployeeID | FirstName | LastName | Department | BirthDate  | Gender | Salary | ManagerID |
+------------+-----------+----------+------------+------------+--------+--------+-----------+
|     3      |   Mary    |   NULL   |   Sales    | 1986-01-05 |   F    | 75000  |     1     |
+------------+-----------+----------+------------+------------+--------+--------+-----------+
1 rows returned

## Task 8: Subquery in WHERE Clause ALL Operator
The ALL Operator checks if a value matches ALL values within a List  
Find female employees whose salaries are greater than the salaries of all male employees

In [76]:
select_query = """SELECT * FROM tbl_employees 
WHERE Gender = 'F' AND Salary > ALL(SELECT SALARY FROM tbl_employees WHERE Gender = 'M');"""
execute_display_query_results(select_query)

+------------+-----------+----------+------------+-----------+--------+--------+-----------+
| EmployeeID | FirstName | LastName | Department | BirthDate | Gender | Salary | ManagerID |
+------------+-----------+----------+------------+-----------+--------+--------+-----------+
+------------+-----------+----------+------------+-----------+--------+--------+-----------+
0 rows returned

## Task 9: Subquery in WHERE Clause EXISTS Operator
Show the details of orders made by customers in Germany

In [77]:
execute_display_query_results(select_all_query("tbl_customers"))
print("\n")
execute_display_query_results(select_all_query("tbl_orders"))

+------------+-----------+----------+---------+-------+
| CustomerID | FirstName | LastName | Country | Score |
+------------+-----------+----------+---------+-------+
|     1      |  Jossef   | Goldberg | Germany |  350  |
|     2      |   Kevin   |  Brown   |   USA   |  900  |
|     3      |   Mary    |   NULL   |   USA   |  750  |
|     4      |   Mark    | Schwarz  | Germany |  500  |
|     5      |   Anna    |  Adams   |   USA   | NULL  |
+------------+-----------+----------+---------+-------+
5 rows returned


+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
| OrderID | ProductID | CustomerID | SalesPersonID | OrderDate  |  ShipDate  | OrderStatus |    ShipAddress     |  BillAddress  | Quantity | Sales |    CreationTime     |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
|    1    |    101    |     2      |       3       | 2025-01-01 | 2025-01-05 |  Delivered  | 9833 Mt. Dias Blv. | 1226 Shoe St. |    1     |  10   | 2025-01-01 12:34:56 |
|    2    |    102    |     3      |       3       | 2025-01-05 | 2025-01-10 |   Shipped   |   250 Race Court   |     NULL      |    1     |  15   | 2025-01-05 23:22:04 |
|    3    |    101    |     1      |       5       | 2025-01-10 | 2025-01-25 |  Delivered  |    8157 W. Book    | 8157 W. Book  |    2     |  20   | 2025-01-10 18:24:08 |
|    4    |    105    |     1      |       3       | 2025-01-20 | 2025-01-25 |   Shipped   | 5724 Victory Lane  |               |    2     |  60   | 2025-01-20 05:50:33 |
|    5    |    104    |     2      |       5       | 2025-02-01 | 2025-02-05 |  Delivered  |        NULL        |     NULL      |    1     |  25   | 2025-02-01 14:02:41 |
|    6    |    104    |     3      |       5       | 2025-02-05 | 2025-02-10 |  Delivered  |  1792 Belmont Rd.  |     NULL      |    2     |  50   | 2025-02-06 15:34:57 |
|    7    |    102    |     1      |       1       | 2025-02-15 | 2025-02-27 |  Delivered  |  136 Balboa Court  |               |    2     |  30   | 2025-02-16 06:22:01 |
|    8    |    101    |     4      |       3       | 2025-02-18 | 2025-02-27 |   Shipped   |   2947 Vine Lane   | 4311 Clay Rd  |    3     |  90   | 2025-02-18 10:45:22 |
|    9    |    101    |     2      |       3       | 2025-03-10 | 2025-03-15 |   Shipped   |   3768 Door Way    |               |    2     |  20   | 2025-03-10 12:59:04 |
|   10    |    102    |     3      |       5       | 2025-03-15 | 2025-03-20 |   Shipped   |        NULL        |     NULL      |    0     |  60   | 2025-03-16 23:25:15 |
+---------+-----------+------------+---------------+------------+------------+-------------+--------------------+---------------+----------+-------+---------------------+
10 rows returned

In [78]:
select_query = """SELECT *, (SELECT Count(*) FROM tbl_orders WHERE tbl_orders.CustomerID = tbl_customers.CustomerID) AS TotalSales FROM tbl_customers;"""
execute_display_query_results(select_query)

+------------+-----------+----------+---------+-------+------------+
| CustomerID | FirstName | LastName | Country | Score | TotalSales |
+------------+-----------+----------+---------+-------+------------+
|     1      |  Jossef   | Goldberg | Germany |  350  |     3      |
|     2      |   Kevin   |  Brown   |   USA   |  900  |     3      |
|     3      |   Mary    |   NULL   |   USA   |  750  |     3      |
|     4      |   Mark    | Schwarz  | Germany |  500  |     1      |
|     5      |   Anna    |  Adams   |   USA   | NULL  |     0      |
+------------+-----------+----------+---------+-------+------------+
5 rows returned

```sql
SELECT col1, col2 FROM table2 WHERE EXISTS (SELECT 1 FROM table1 WHERE table1.ID = table2.ID)
```
For each row in the mainn query, run the subquery. NO Result? Exclude Row of MainQuery in Final Result

In [79]:
#Show the details of orders made by customers in Germany
select_query = """SELECT * FROM tbl_orders WHERE EXISTS (SELECT 1 FROM tbl_customers WHERE tbl_customers.CustomerID = tbl_orders.CustomerID AND Country = 'Germany')"""
execute_display_query_results(select_query)

+---------+-----------+------------+---------------+------------+------------+-------------+-------------------+--------------+----------+-------+---------------------+
| OrderID | ProductID | CustomerID | SalesPersonID | OrderDate  |  ShipDate  | OrderStatus |    ShipAddress    | BillAddress  | Quantity | Sales |    CreationTime     |
+---------+-----------+------------+---------------+------------+------------+-------------+-------------------+--------------+----------+-------+---------------------+
|    3    |    101    |     1      |       5       | 2025-01-10 | 2025-01-25 |  Delivered  |   8157 W. Book    | 8157 W. Book |    2     |  20   | 2025-01-10 18:24:08 |
|    4    |    105    |     1      |       3       | 2025-01-20 | 2025-01-25 |   Shipped   | 5724 Victory Lane |              |    2     |  60   | 2025-01-20 05:50:33 |
|    7    |    102    |     1      |       1       | 2025-02-15 | 2025-02-27 |  Delivered  | 136 Balboa Court  |              |    2     |  30   | 2025-02-16 06:22:01 |
|    8    |    101    |     4      |       3       | 2025-02-18 | 2025-02-27 |   Shipped   |  2947 Vine Lane   | 4311 Clay Rd |    3     |  90   | 2025-02-18 10:45:22 |
+---------+-----------+------------+---------------+------------+------------+-------------+-------------------+--------------+----------+-------+---------------------+
4 rows returned

# Case Statements
Evaluates a list of conditions and returns a value when the first condition is met
```sql
CASE 
    WHEN condition1 THEN result1
    WHEN condition2 THEN result2
    .....
    ELSE resultn --optional
END
```
Main purpose is Data Transformation. Create New Columns based on Existing Columns.
- Categorizing Data
- Mapping Values: F - Female, Male -> Male

Rules: The data type of the results must be matching

## Task 1 
Generate a report showing the total sales for each category 
- High: If sales higher than 50
- Medium: If sales is between 21 and 50
- low: If the above conditions are not met

In [80]:
select_case_query = """SELECT OrderID, Sales, 
CASE 
WHEN Sales > 50 THEN 'High'
WHEN Sales BETWEEN 21 AND 50 THEN 'Medium'
ELSE 'Low'
END AS Category
FROM tbl_orders
"""

execute_display_query_results(select_case_query)

+---------+-------+----------+
| OrderID | Sales | Category |
+---------+-------+----------+
|    1    |  10   |   Low    |
|    2    |  15   |   Low    |
|    3    |  20   |   Low    |
|    4    |  60   |   High   |
|    5    |  25   |  Medium  |
|    6    |  50   |  Medium  |
|    7    |  30   |  Medium  |
|    8    |  90   |   High   |
|    9    |  20   |   Low    |
|   10    |  60   |   High   |
+---------+-------+----------+
10 rows returned

In [81]:
select_case_query = """SELECT Category, SUM(Sales) AS TotalSales FROM
(SELECT OrderID, Sales,
CASE 
WHEN Sales > 50 THEN 'High'
WHEN Sales BETWEEN 21 AND 50 THEN 'Medium'
ELSE 'Low'
END AS Category
FROM tbl_orders) AS T
GROUP BY Category
ORDER BY TotalSales DESC;
"""

execute_display_query_results(select_case_query)

+----------+------------+
| Category | TotalSales |
+----------+------------+
|   High   |    210     |
|  Medium  |    105     |
|   Low    |     65     |
+----------+------------+
3 rows returned

## Task 2
Retrieve employee details with gender displayed as full text

In [82]:
select_case_query = """SELECT * FROM
(SELECT *, 
CASE 
WHEN Gender = 'F' THEN 'Female'
WHEN Gender = 'M' THEN 'Male'
ELSE 'Other'
END AS GenderFullText
FROM tbl_employees) AS T;
"""

execute_display_query_results(select_case_query)

+------------+-----------+----------+------------+------------+--------+--------+-----------+----------------+
| EmployeeID | FirstName | LastName | Department | BirthDate  | Gender | Salary | ManagerID | GenderFullText |
+------------+-----------+----------+------------+------------+--------+--------+-----------+----------------+
|     1      |   Frank   |   Lee    | Marketing  | 1988-12-05 |   M    | 55000  |   NULL    |      Male      |
|     2      |   Kevin   |  Brown   | Marketing  | 1972-11-25 |   M    | 65000  |     1     |      Male      |
|     3      |   Mary    |   NULL   |   Sales    | 1986-01-05 |   F    | 75000  |     1     |     Female     |
|     4      |  Michael  |   Ray    |   Sales    | 1977-02-10 |   M    | 90000  |     2     |      Male      |
|     5      |   Carol   |  Baker   |   Sales    | 1982-02-11 |   F    | 55000  |     3     |     Female     |
+------------+-----------+----------+------------+------------+--------+--------+-----------+----------------+
5 rows returned

## Task 3
Retrieve customer details with abbreviated country code

In [83]:
execute_display_query_results(select_all_query("tbl_customers"))

+------------+-----------+----------+---------+-------+
| CustomerID | FirstName | LastName | Country | Score |
+------------+-----------+----------+---------+-------+
|     1      |  Jossef   | Goldberg | Germany |  350  |
|     2      |   Kevin   |  Brown   |   USA   |  900  |
|     3      |   Mary    |   NULL   |   USA   |  750  |
|     4      |   Mark    | Schwarz  | Germany |  500  |
|     5      |   Anna    |  Adams   |   USA   | NULL  |
+------------+-----------+----------+---------+-------+
5 rows returned

In [84]:
select_case_query = """SELECT DISTINCT Country FROM tbl_customers;
"""

execute_display_query_results(select_case_query)

+---------+
| Country |
+---------+
| Germany |
|   USA   |
+---------+
2 rows returned

In [85]:
select_case_query = """SELECT * FROM
(SELECT *, 
CASE 
WHEN Country = 'Germany' THEN 'DE'
WHEN Country = 'USA' THEN 'US'
ELSE 'Other'
END AS CountryAbb
FROM tbl_customers) AS T;
"""

execute_display_query_results(select_case_query)

+------------+-----------+----------+---------+-------+------------+
| CustomerID | FirstName | LastName | Country | Score | CountryAbb |
+------------+-----------+----------+---------+-------+------------+
|     1      |  Jossef   | Goldberg | Germany |  350  |     DE     |
|     2      |   Kevin   |  Brown   |   USA   |  900  |     US     |
|     3      |   Mary    |   NULL   |   USA   |  750  |     US     |
|     4      |   Mark    | Schwarz  | Germany |  500  |     DE     |
|     5      |   Anna    |  Adams   |   USA   | NULL  |     US     |
+------------+-----------+----------+---------+-------+------------+
5 rows returned

In [86]:
## This form is only used when the operator is equal

select_case_query = """SELECT * FROM
(SELECT *, 
CASE Gender
WHEN 'F' THEN 'Female'
WHEN 'M' THEN 'Male'
ELSE 'Other'
END AS GenderFullText
FROM tbl_employees) AS T;
"""

execute_display_query_results(select_case_query)

+------------+-----------+----------+------------+------------+--------+--------+-----------+----------------+
| EmployeeID | FirstName | LastName | Department | BirthDate  | Gender | Salary | ManagerID | GenderFullText |
+------------+-----------+----------+------------+------------+--------+--------+-----------+----------------+
|     1      |   Frank   |   Lee    | Marketing  | 1988-12-05 |   M    | 55000  |   NULL    |      Male      |
|     2      |   Kevin   |  Brown   | Marketing  | 1972-11-25 |   M    | 65000  |     1     |      Male      |
|     3      |   Mary    |   NULL   |   Sales    | 1986-01-05 |   F    | 75000  |     1     |     Female     |
|     4      |  Michael  |   Ray    |   Sales    | 1977-02-10 |   M    | 90000  |     2     |      Male      |
|     5      |   Carol   |  Baker   |   Sales    | 1982-02-11 |   F    | 55000  |     3     |     Female     |
+------------+-----------+----------+------------+------------+--------+--------+-----------+----------------+
5 rows returned

## Task 4
Find the average scores of customers and treat Nulls as 0. Additional provide details such as CustomerID & LastName

In [87]:
select_case_query = """SELECT *, AVG(Score) OVER() AS AverageScore FROM
(SELECT *, 
CASE 
WHEN Country = 'Germany' THEN 'DE'
WHEN Country = 'USA' THEN 'US'
ELSE 'Other'
END AS CountryAbb
FROM tbl_customers) AS T;
"""

execute_display_query_results(select_case_query)

+------------+-----------+----------+---------+-------+------------+--------------+
| CustomerID | FirstName | LastName | Country | Score | CountryAbb | AverageScore |
+------------+-----------+----------+---------+-------+------------+--------------+
|     1      |  Jossef   | Goldberg | Germany |  350  |     DE     |   625.0000   |
|     2      |   Kevin   |  Brown   |   USA   |  900  |     US     |   625.0000   |
|     3      |   Mary    |   NULL   |   USA   |  750  |     US     |   625.0000   |
|     4      |   Mark    | Schwarz  | Germany |  500  |     DE     |   625.0000   |
|     5      |   Anna    |  Adams   |   USA   | NULL  |     US     |   625.0000   |
+------------+-----------+----------+---------+-------+------------+--------------+
5 rows returned

In [88]:
select_case_query = """SELECT *,
CASE 
WHEN Score IS NULL THEN 0
ELSE Score
End ScoreClean,
AVG(SCORE) OVER() AS AverageScore
FROM tbl_customers;
"""

execute_display_query_results(select_case_query)

+------------+-----------+----------+---------+-------+------------+--------------+
| CustomerID | FirstName | LastName | Country | Score | ScoreClean | AverageScore |
+------------+-----------+----------+---------+-------+------------+--------------+
|     1      |  Jossef   | Goldberg | Germany |  350  |    350     |   625.0000   |
|     2      |   Kevin   |  Brown   |   USA   |  900  |    900     |   625.0000   |
|     3      |   Mary    |   NULL   |   USA   |  750  |    750     |   625.0000   |
|     4      |   Mark    | Schwarz  | Germany |  500  |    500     |   625.0000   |
|     5      |   Anna    |  Adams   |   USA   | NULL  |     0      |   625.0000   |
+------------+-----------+----------+---------+-------+------------+--------------+
5 rows returned

In [89]:
select_case_query = """SELECT *,
AVG(
    CASE 
        WHEN Score IS NULL THEN 0
        ELSE Score
    End) OVER() AverageScoreClean,
AVG(SCORE) OVER() AS AverageScore
FROM tbl_customers;
"""

execute_display_query_results(select_case_query)

+------------+-----------+----------+---------+-------+-------------------+--------------+
| CustomerID | FirstName | LastName | Country | Score | AverageScoreClean | AverageScore |
+------------+-----------+----------+---------+-------+-------------------+--------------+
|     1      |  Jossef   | Goldberg | Germany |  350  |     500.0000      |   625.0000   |
|     2      |   Kevin   |  Brown   |   USA   |  900  |     500.0000      |   625.0000   |
|     3      |   Mary    |   NULL   |   USA   |  750  |     500.0000      |   625.0000   |
|     4      |   Mark    | Schwarz  | Germany |  500  |     500.0000      |   625.0000   |
|     5      |   Anna    |  Adams   |   USA   | NULL  |     500.0000      |   625.0000   |
+------------+-----------+----------+---------+-------+-------------------+--------------+
5 rows returned

In [90]:
# Conditional Aggregation
# Apply aggregate functions only on subsets that fulfill certain conditions

## Task 5
Count how many times each customer has made an order with sale greater than 30

In [91]:
select_query = """SELECT OrderID, CustomerID, Sales FROM tbl_orders ORDER BY CustomerID"""

execute_display_query_results(select_query)

+---------+------------+-------+
| OrderID | CustomerID | Sales |
+---------+------------+-------+
|    3    |     1      |  20   |
|    4    |     1      |  60   |
|    7    |     1      |  30   |
|    1    |     2      |  10   |
|    5    |     2      |  25   |
|    9    |     2      |  20   |
|    2    |     3      |  15   |
|    6    |     3      |  50   |
|   10    |     3      |  60   |
|    8    |     4      |  90   |
+---------+------------+-------+
10 rows returned

In [92]:
select_query = """SELECT OrderID, CustomerID, Sales,
CASE 
WHEN Sales > 30 THEN 1
ELSE 0
END AS SalesFlag
FROM tbl_orders ORDER BY CustomerID"""
execute_display_query_results(select_query)

+---------+------------+-------+-----------+
| OrderID | CustomerID | Sales | SalesFlag |
+---------+------------+-------+-----------+
|    3    |     1      |  20   |     0     |
|    4    |     1      |  60   |     1     |
|    7    |     1      |  30   |     0     |
|    1    |     2      |  10   |     0     |
|    5    |     2      |  25   |     0     |
|    9    |     2      |  20   |     0     |
|    2    |     3      |  15   |     0     |
|    6    |     3      |  50   |     1     |
|   10    |     3      |  60   |     1     |
|    8    |     4      |  90   |     1     |
+---------+------------+-------+-----------+
10 rows returned

In [93]:
select_query = """SELECT CustomerID, 
SUM(CASE 
WHEN Sales > 30 THEN 1
ELSE 0
END) AS TotalOrders
FROM tbl_orders GROUP BY CustomerID"""
execute_display_query_results(select_query)

+------------+-------------+
| CustomerID | TotalOrders |
+------------+-------------+
|     2      |      0      |
|     3      |      2      |
|     1      |      1      |
|     4      |      1      |
+------------+-------------+
4 rows returned

In [94]:
select_query = """SELECT CustomerID, 
SUM(CASE 
WHEN Sales > 30 THEN 1
ELSE 0
END) AS TotalOrdersHigh,
COUNT(*) As TotalOrders
FROM tbl_orders GROUP BY CustomerID"""
execute_display_query_results(select_query)

+------------+-----------------+-------------+
| CustomerID | TotalOrdersHigh | TotalOrders |
+------------+-----------------+-------------+
|     2      |        0        |      3      |
|     3      |        2        |      3      |
|     1      |        1        |      3      |
|     4      |        1        |      1      |
+------------+-----------------+-------------+
4 rows returned